app/controllers/api/equipment_controller.rb

    def index
      equipments = Equipment.all
      if equipments.present?
---
SELECT `equipment`.* FROM `equipment`

    def show
      equipment = Equipment.where(id:params[:id])
      if equipment.present?
---
SELECT `equipment`.* FROM `equipment` WHERE `equipment`.`id` = 1

    def update
      equipment = Equipment.where(id:params[:id])
      if equipment.update(active: params[:active])
---
SELECT `equipment`.* FROM `equipment` WHERE `equipment`.`id` = 1
UPDATE `equipment` SET `equipment`.`active` = FALSE, `equipment`.`updated_at` = '2020-02-02 23:56:34.844822' WHERE `equipment`.`id` = 1