app/views/user/edit.html.erb

      <label for="usr">Department:</label>
      <%= select(params[:department_id],"department_id", @department.collect {|p| [ p.department_name, p.id, selected:"#{u.department_id}" ] }, { include_blank: true }, class: "form-control")%><br>
---
SELECT `departments`.* FROM `departments`