app/controllers/books_controller.rb

SELECT `books`.* FROM `books`
---
  def index
    if params[:search].present?
      @search = params[:search];
      @books = Book.search(@search).order("created_at DESC").paginate(page: params[:page], per_page: PER_PAGE)
    else
      @books = Book.all.paginate(page: params[:page], per_page: PER_PAGE)