app/controllers/equipment_controller.rb

  def index

    current_time = Time.now.strftime("%Y-%m-%d %H:%M")
    current_time_to_i = convert_string_to_int(current_time)
    @equipment = Equipment.all
    gon.equipment = Equipment.all
    board = Dino::Board.new(Dino::TxRx.new)
    led = Dino::Components::Led.new(pin: 4, board: board)
    led1 = Dino::Components::Led.new(pin: 5, board: board)
    led2 = Dino::Components::Led.new(pin: 15, board: board)

    @equipment.each do |q|
---
SELECT `equipment`.* FROM `equipment`
SELECT `equipment`.* FROM `equipment` WHERE `equipment`.`id` = 1 LIMIT 1

  def create
    @equipment = Equipment.new(equipment_params)

    respond_to do |format|
      if @equipment.save
---
INSERT INTO `equipment` (`equiqment_name`, `active`, `created_at`, `updated_at`) VALUES ('Den16', FALSE, '2019-12-01 21:52:02.676928', '2019-12-01 21:52:02.676928')

  def update
    respond_to do |format|
      if @equipment.update(equipment_params)
---
UPDATE `equipment` SET `equipment`.`timeout` = '2020-01-19 09:24:00', `equipment`.`updated_at` = '2020-01-19 09:23:52.458979' WHERE `equipment`.`id` = 1

    def set_equipment
      @equipment = Equipment.find(params[:id])
---
SELECT `equipment`.* FROM `equipment` WHERE `equipment`.`id` = 1 LIMIT 1