app/controllers/user_controller.rb

SELECT `users`.* FROM `users` WHERE `users`.`id` = 2 ORDER BY `users`.`id` ASC LIMIT 1
SELECT `departments`.* FROM `departments`
---
  def edit
    @user = User.where(:id=>current_user.id)
    @department = Department.all

SELECT `users`.* FROM `users` WHERE `users`.`id` = 2
UPDATE `users` SET `users`.`department_id` = 4, `users`.`updated_at` = '2020-01-17 23:14:24.274269' WHERE `users`.`id` = 2
---
  def update
      a = User.where(:id=>current_user.id).update(:name=>params['name'], :department_id=>params['department_id'])